# *_* coding:utf-8 *_*
# @author:sdh
# @Time : 2021/9/19 0019 07:22
# QA =  question answer
# python语言的几个须知
"""
1  python是一种解释型语言，程序的运行需要借助于解释器。
2  python2和python3的差异很大，目前主要是Python3。
3  python的主要用途
        (1)web网站的开发。
        (2)数据处理如爬虫、数据分析、机器学习。
        (3)人工智能软件方向的应用包括计算机视觉、自然语言处理。
4 python语言的主要基础知识点
        (1) 基本数据类型
        (2) 程序的流程结构
        (3) 函数
        (4) 面向对象程序设计
        (5) 类和对象的创建
        (6) 实例属性和实例方法、私有实例属性和私有实例方法
        (7) 类属性和类方法，私有类属性和类方法
        (8) 静态属性和静态方法，私有静态属性和静态方法
        (8) 内置属性和内置方法
        (9) 继承和多态，单继承和多继承
        (10)迭代器
        (11) 线程
        (12) 进程
        (13) 协程
"""
